; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 426763 2 2 2 7 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation6 - direction
	Star3 - direction
	Star0 - direction
	Star4 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 Star4)
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph1)
))

)

; plan
1. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 1 of 4
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 4
3. (turn_to satellite1 star4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star4)
   goals met: 2 of 4
4. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 2 of 4
5. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 1 of 4
6. (turn_to satellite1 star8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star8)
   goals met: 0 of 4
7. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 1 of 4
8. (take_image satellite1 star8 instrument3 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 2 of 4
9. (turn_to satellite1 star7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star7)
   goals met: 2 of 4
10. (take_image satellite1 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 3 of 4
11. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 4 of 4
